-- Заполнение таблицы Жанр
INSERT INTO Genre
VALUES(1, 'Rok')

INSERT INTO Genre
VALUES(3, 'Jaz')

UPDATE Genre
SET genre_id = 2
WHERE genre_id = 3

INSERT INTO Genre
VALUES(3, 'Jaz')

-- Заполнение таблицы Исполнители
INSERT INTO Executere
VALUES(1, 'Сергей'), (2, 'Ирина'), (3, 'Анна'), (4, 'Олег')

INSERT INTO Executere
VALUES(5, 'В')

UPDATE Executere
SET name = 'Владимир Иванов'
WHERE executere_id = 5

-- Заполнение таблицы Альбом
INSERT INTO albom 
VALUES(1, 'Маэстро', 2017), (2, 'Классика', 2018), (3, 'Кавер', 2018), (4, 'Ретро', 2019), 
(5, 'Интро', 2019), (6, 'Аккорд', 2020), (7, 'Грок', 2021)

-- Заполнение таблицы Треков
INSERT INTO track 
VALUES(1, 'Маэстро1', 3.5, 1), (2, 'Маэстро2', 5.5, 1), (3, 'Маэстро3', 3, 1),
(4, 'Классика1', 4, 2), (5, 'Классика2', 2, 2), (6, 'Классика3', 6, 2),
(7, 'Кавер1', 2, 3), (8, 'Кавер2', 3, 3),
(9, 'Ретро1', 4, 4), (10, 'Ретро2', 4, 4), (11, 'Ретро3', 4, 4),
(12, 'Интро1', 2, 5),
(13, 'Аккорд1', 3, 6), (14, 'Аккорд2', 4, 6),
(15, 'Грок1', 2021, 7)

INSERT INTO track 
values (16, 'Мой Грок1', 2021, 7)

UPDATE track
SET duration = 2
WHERE track_id = 15

UPDATE track
SET duration = 2
WHERE track_id = 16

-- Заполнение таблицы Сборник
INSERT INTO mix 
VALUES(1, 'Сборник1', 2018), (2, 'Сборник2', 2019), (3, 'Сборник3', 2019), 
(4, 'Сборник4', 2020), (5, 'Сборник5', 2020)

-- Заполнение таблицы промежуточной Жанр_Исполнители
INSERT INTO GenreExecutere 
values (1, 1), (1, 2), (1, 3),
(2, 1), (2, 2), (2, 3), (2, 4),
(3, 2), (3, 5)

-- Заполнение таблицы промежуточной Альбом_Исполнители
insert into AlbomExecutere
values(1, 1), (2, 5), (3, 3), (4, 4), (5, 2), (6, 3), (7,1)

-- Заполнение таблицы промежуточной Трек_Сборник
insert into TrackMix
values(1, 1), (2, 1), (3, 1), 
	  (4, 2), (5, 2), (6, 2), 
	  (7, 3), (8, 3), (9, 3),
	  (10, 4), (11, 4), (12, 4),
	  (13, 5), (14, 5), (15, 5), (16, 5)